###################################################################

# Created by write_sdc on Sun Dec 16 13:20:38 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_capacitance 0.00746692 [current_design]
set_max_area 0
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports clk]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports ctr]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports rst]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[32]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[31]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[30]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[29]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[28]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[27]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[26]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[25]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[24]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[23]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[22]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[21]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[20]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[19]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[18]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[17]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[16]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[15]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[14]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[13]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[12]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[11]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[10]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[9]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[8]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[7]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[6]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[5]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[4]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[3]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[2]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {ai[1]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[32]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[31]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[30]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[29]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[28]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[27]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[26]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[25]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[24]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[23]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[22]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[21]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[20]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[19]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[18]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[17]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[16]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[15]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[14]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[13]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[12]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[11]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[10]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[9]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[8]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[7]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[6]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[5]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[4]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[3]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[2]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {gi[1]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[32]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[31]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[30]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[29]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[28]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[27]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[26]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[25]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[24]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[23]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[22]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[21]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[20]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[19]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[18]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[17]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[16]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[15]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[14]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[13]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[12]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[11]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[10]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[9]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[8]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[7]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[6]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[5]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[4]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[3]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[2]}]
set_driving_cell -lib_cell DRNHSV1 -pin Q [get_ports {bi[1]}]
set_load -pin_load 0.00466682 [get_ports {po[1]}]
set_load -pin_load 0.00466682 [get_ports {po[2]}]
set_load -pin_load 0.00466682 [get_ports {po[3]}]
set_load -pin_load 0.00466682 [get_ports {po[4]}]
set_load -pin_load 0.00466682 [get_ports {po[5]}]
set_load -pin_load 0.00466682 [get_ports {po[6]}]
set_load -pin_load 0.00466682 [get_ports {po[7]}]
set_load -pin_load 0.00466682 [get_ports {po[8]}]
set_load -pin_load 0.00466682 [get_ports {po[9]}]
set_load -pin_load 0.00466682 [get_ports {po[10]}]
set_load -pin_load 0.00466682 [get_ports {po[11]}]
set_load -pin_load 0.00466682 [get_ports {po[12]}]
set_load -pin_load 0.00466682 [get_ports {po[13]}]
set_load -pin_load 0.00466682 [get_ports {po[14]}]
set_load -pin_load 0.00466682 [get_ports {po[15]}]
set_load -pin_load 0.00466682 [get_ports {po[16]}]
set_load -pin_load 0.00466682 [get_ports {po[17]}]
set_load -pin_load 0.00466682 [get_ports {po[18]}]
set_load -pin_load 0.00466682 [get_ports {po[19]}]
set_load -pin_load 0.00466682 [get_ports {po[20]}]
set_load -pin_load 0.00466682 [get_ports {po[21]}]
set_load -pin_load 0.00466682 [get_ports {po[22]}]
set_load -pin_load 0.00466682 [get_ports {po[23]}]
set_load -pin_load 0.00466682 [get_ports {po[24]}]
set_load -pin_load 0.00466682 [get_ports {po[25]}]
set_load -pin_load 0.00466682 [get_ports {po[26]}]
set_load -pin_load 0.00466682 [get_ports {po[27]}]
set_load -pin_load 0.00466682 [get_ports {po[28]}]
set_load -pin_load 0.00466682 [get_ports {po[29]}]
set_load -pin_load 0.00466682 [get_ports {po[30]}]
set_load -pin_load 0.00466682 [get_ports {po[31]}]
set_load -pin_load 0.00466682 [get_ports {po[32]}]
create_clock [get_ports clk]  -period 0.5  -waveform {0 0.25}
set_clock_latency 0.1  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_max_delay 2  -from [list [get_ports clk] [get_ports ctr] [get_ports rst] [get_ports {ai[32]}] [get_ports {ai[31]}] [get_ports {ai[30]}] [get_ports {ai[29]}] [get_ports {ai[28]}] [get_ports {ai[27]}] [get_ports {ai[26]}] [get_ports {ai[25]}] [get_ports {ai[24]}] [get_ports {ai[23]}] [get_ports {ai[22]}] [get_ports {ai[21]}] [get_ports {ai[20]}] [get_ports {ai[19]}] [get_ports {ai[18]}] [get_ports {ai[17]}] [get_ports {ai[16]}] [get_ports {ai[15]}] [get_ports {ai[14]}] [get_ports {ai[13]}] [get_ports {ai[12]}] [get_ports {ai[11]}] [get_ports {ai[10]}] [get_ports {ai[9]}] [get_ports {ai[8]}] [get_ports {ai[7]}] [get_ports {ai[6]}] [get_ports {ai[5]}] [get_ports {ai[4]}] [get_ports {ai[3]}] [get_ports {ai[2]}] [get_ports {ai[1]}] [get_ports {gi[32]}] [get_ports {gi[31]}] [get_ports {gi[30]}] [get_ports {gi[29]}] [get_ports {gi[28]}] [get_ports {gi[27]}] [get_ports {gi[26]}] [get_ports {gi[25]}] [get_ports {gi[24]}] [get_ports {gi[23]}] [get_ports {gi[22]}] [get_ports {gi[21]}] [get_ports {gi[20]}] [get_ports {gi[19]}] [get_ports {gi[18]}] [get_ports {gi[17]}] [get_ports {gi[16]}] [get_ports {gi[15]}] [get_ports {gi[14]}] [get_ports {gi[13]}] [get_ports {gi[12]}] [get_ports {gi[11]}] [get_ports {gi[10]}] [get_ports {gi[9]}] [get_ports {gi[8]}] [get_ports {gi[7]}] [get_ports {gi[6]}] [get_ports {gi[5]}] [get_ports {gi[4]}] [get_ports {gi[3]}] [get_ports {gi[2]}] [get_ports {gi[1]}] [get_ports {bi[32]}] [get_ports {bi[31]}] [get_ports {bi[30]}] [get_ports {bi[29]}] [get_ports {bi[28]}] [get_ports {bi[27]}] [get_ports {bi[26]}] [get_ports {bi[25]}] [get_ports {bi[24]}] [get_ports {bi[23]}] [get_ports {bi[22]}] [get_ports {bi[21]}] [get_ports {bi[20]}] [get_ports {bi[19]}] [get_ports {bi[18]}] [get_ports {bi[17]}] [get_ports {bi[16]}] [get_ports {bi[15]}] [get_ports {bi[14]}] [get_ports {bi[13]}] [get_ports {bi[12]}] [get_ports {bi[11]}] [get_ports {bi[10]}] [get_ports {bi[9]}] [get_ports {bi[8]}] [get_ports {bi[7]}] [get_ports {bi[6]}] [get_ports {bi[5]}] [get_ports {bi[4]}] [get_ports {bi[3]}] [get_ports {bi[2]}] [get_ports {bi[1]}]]  -to [list [get_ports {po[1]}] [get_ports {po[2]}] [get_ports {po[3]}] [get_ports {po[4]}] [get_ports {po[5]}] [get_ports {po[6]}] [get_ports {po[7]}] [get_ports {po[8]}] [get_ports {po[9]}] [get_ports {po[10]}] [get_ports {po[11]}] [get_ports {po[12]}] [get_ports {po[13]}] [get_ports {po[14]}] [get_ports {po[15]}] [get_ports {po[16]}] [get_ports {po[17]}] [get_ports {po[18]}] [get_ports {po[19]}] [get_ports {po[20]}] [get_ports {po[21]}] [get_ports {po[22]}] [get_ports {po[23]}] [get_ports {po[24]}] [get_ports {po[25]}] [get_ports {po[26]}] [get_ports {po[27]}] [get_ports {po[28]}] [get_ports {po[29]}] [get_ports {po[30]}] [get_ports {po[31]}] [get_ports {po[32]}]]
set_input_delay -clock clk  -max 0.01  [get_ports ctr]
set_input_delay -clock clk  -min -0.01  [get_ports ctr]
set_input_delay -clock clk  -max 0.01  [get_ports rst]
set_input_delay -clock clk  -min -0.01  [get_ports rst]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[32]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[32]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[31]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[31]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[30]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[30]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[29]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[29]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[28]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[28]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[27]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[27]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[26]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[26]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[25]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[25]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[24]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[24]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[23]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[23]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[22]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[22]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[21]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[21]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[20]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[20]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[19]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[19]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[18]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[18]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[17]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[17]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[16]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[16]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[15]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[15]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[14]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[14]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[13]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[13]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[12]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[12]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[11]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[11]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[10]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[10]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[9]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[9]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[8]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[8]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[7]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[7]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[6]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[6]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[5]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[5]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[4]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[4]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[3]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[3]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[2]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[2]}]
set_input_delay -clock clk  -max 0.01  [get_ports {ai[1]}]
set_input_delay -clock clk  -min -0.01  [get_ports {ai[1]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[32]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[32]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[31]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[31]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[30]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[30]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[29]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[29]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[28]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[28]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[27]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[27]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[26]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[26]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[25]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[25]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[24]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[24]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[23]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[23]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[22]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[22]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[21]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[21]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[20]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[20]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[19]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[19]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[18]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[18]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[17]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[17]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[16]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[16]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[15]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[15]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[14]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[14]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[13]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[13]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[12]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[12]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[11]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[11]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[10]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[10]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[9]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[9]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[8]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[8]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[7]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[7]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[6]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[6]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[5]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[5]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[4]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[4]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[3]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[3]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[2]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[2]}]
set_input_delay -clock clk  -max 0.01  [get_ports {gi[1]}]
set_input_delay -clock clk  -min -0.01  [get_ports {gi[1]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[32]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[32]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[31]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[31]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[30]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[30]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[29]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[29]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[28]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[28]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[27]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[27]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[26]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[26]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[25]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[25]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[24]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[24]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[23]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[23]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[22]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[22]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[21]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[21]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[20]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[20]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[19]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[19]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[18]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[18]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[17]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[17]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[16]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[16]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[15]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[15]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[14]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[14]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[13]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[13]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[12]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[12]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[11]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[11]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[10]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[10]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[9]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[9]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[8]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[8]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[7]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[7]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[6]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[6]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[5]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[5]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[4]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[4]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[3]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[3]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[2]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[2]}]
set_input_delay -clock clk  -max 0.01  [get_ports {bi[1]}]
set_input_delay -clock clk  -min -0.01  [get_ports {bi[1]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[1]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[1]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[2]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[2]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[3]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[3]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[4]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[4]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[5]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[5]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[6]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[6]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[7]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[7]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[8]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[8]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[9]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[9]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[10]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[10]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[11]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[11]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[12]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[12]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[13]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[13]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[14]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[14]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[15]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[15]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[16]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[16]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[17]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[17]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[18]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[18]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[19]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[19]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[20]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[20]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[21]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[21]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[22]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[22]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[23]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[23]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[24]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[24]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[25]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[25]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[26]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[26]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[27]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[27]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[28]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[28]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[29]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[29]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[30]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[30]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[31]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[31]}]
set_output_delay -clock clk  -max 0.02  [get_ports {po[32]}]
set_output_delay -clock clk  -min -0.01  [get_ports {po[32]}]
